---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyList
source: html/275ec135-8c7f-27c3-6ac0-3a0f8f764baa.htm
---
# AssetPropertyList Methods

Adds a new connected asset attached to this asset property, if it allows it.